import { Injectable } from '@angular/core';

@Injectable({
  providedIn: 'root',
})
export class DataService {
  constructor() {}

  static quiz1: QuizModel[] = [
    {
      Id: 1,
      Question: 'დეკოდირების მედია ყველაზე მეტად ჰგავს:',
      Description: 'Test',
      Answer: new Map([
        [1, 'ა) წიგნების კითხვას'],
        [2, 'ბ) ექსპერიმენტის ჩატარებას'],
        [3, 'გ) საიდუმლოს ამოხსნას'],
        [4, 'დ) საჭმლის მომზადებას'],
      ]),
      correctQuestionId: 3,
    },
    {
      Id: 2,
      Question: 'ჩამოთვლილთაგან რომელია „მედია“?',
      Description: 'Test',
      Answer: new Map([
        [
          1,
          'ა)ტელევიზია, ფილმები, ჟურნალები, გაზეთები, ვიდეო თამაშები, მუსიკა, რადიო და რეკლამა',
        ],
        [
          2,
          'ბ)სოციალური ქსელები, ფოტოების და ვიდეოების გაზიარების ვებსაიტები და სხვა ონლაინ შინაარსი',
        ],
        [3, 'გ)არაზუსტი ინფორმაცია'],
        [4, 'გ)ორივე ა და ბ '],
      ]),
      correctQuestionId: 4,
    },
    {
      Id: 3,
      Question: 'სიტყვა „წერა-კითხვა“ მედიაწიგნიერებაში აღნიშნავს:',
      Description: 'Test',
      Answer: new Map([
        [1, 'ა) ჩემი ლექსიკის გაუმჯობესება'],
        [2, 'ბ) მნიშვნელობისა და შეტყობინებების გააზრება'],
        [3, 'გ) კითხულობს ტექნოლოგიას'],
        [4, 'დ) ისწავლეთ უფრო სწრაფად კითხვა'],
      ]),
      correctQuestionId: 4,
    },
    {
      Id: 4,
      Question: 'რომელ ტერმინს ვუწოდებთ მედიაში გავცელებულ ცრუ ინფორმაციას?',
      Description: 'Test',
      Answer: new Map([
        [1, 'ა) პროპაგანდა'],
        [2, 'ბ) სატირა'],
        [3, 'ბ) დეზინფორმაცია'],
        [4, 'დ) Გასართობი'],
      ]),
      correctQuestionId: 3,
    },
    {
      Id: 5,
      Question: 'რა არის "ClickBait"?',
      Description: 'Test',
      Answer: new Map([
        [1, 'კონტენტს, რომლის სათაური შეცვლილია შეცდომაში შეყვანის მიზნით'],
        [2, 'გრძელვადიანი საგამოძიებო ჟურნალისტიკა'],
        [3, 'კონტენტი, რომელიც ხელმისაწვდომია მხოლოდ ფასიანი გამოწერებით'],
        [4, 'გადამოწმებული და ზუსტი ახალი სტატიები'],
      ]),
      correctQuestionId: 1,
    },
  ];

  allQuize: FullQuizModel[] = [
    {
      Id: 1,
      Quiz: DataService.quiz1,
      Title: 'ქვიზი 1',
    },
    {
      Id: 2,
      Quiz: DataService.quiz1,
      Title: 'ქვიზი 2',
    },
  ];

  nextGame = [
    [
      {
        id: 1,
        text: 'შენ მედიაწიგნიერების შესახებ საერთოდ არაფერი არ იცი. შეისწავლე ის, რათა დაცული იყო ონლაინ',
      },
    ],
    [
      {
        id: 1,
        text: 'შენ არ იცი მედიაწიგნიერების შესახებ ბევრი რამ. უკეთ გაეცანი მას, რათა დაცული იყო ონლაინ',
      },
    ],
    [
      {
        id: 1,
        text: 'შენ ასე თუ ისე გესმის რა არის მედიაწიგნიერება. უკეთესია კარგად შეისწავლო',
      },
    ],
    [
      {
        id: 1,
        text: 'შენ იცი მედიაწიგნიერების საკითხები, მაგრამ გამეორება არ გაწყენდა',
      },
    ],
    [
      {
        id: 1,
        text: 'შენ ძალიან კარგად იცი მედიაწიგნიერებასთან დაკავშირებული საკითხები და მარტივად შეძლებ დეზინფორმაციისგან თავის დაცვას',
      },
    ],
  ];
}

export class QuizModel {
  Id!: number;
  Question!: string;
  Description!: string;
  Answer!: Map<number, string>;
  correctQuestionId!: number;
}

export class FullQuizModel {
  Id!: number;
  Quiz!: QuizModel[];
  Title!: string;
}
